example/dim/0.atmospheric/0.isotherm/Ue
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      Ue;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "$FOAM_CASE/initialConditions";

dimensions      [ 1 2 -3 0 0 -1 0 ];

internalField   uniform 0;

boundaryField
{
    outer
    {
        type            fixedValue;
        value           uniform 0;
    }
    inner
    {
        type            fixedValue;
        value           uniform 1500;
    }
}


// ************************************************************************* //
