example/dim/0.atmospheric/0.isotherm/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "$FOAM_CASE/initialConditions";

dimensions      [ 0 2 -2 0 0 0 0 ];

internalField   uniform $pInitial;

boundaryField
{
    outer
    {
        type            fixedFluxPressure;
        gradient        uniform 0;
        value           uniform $pInitial;
    }
    inner
    {
        type            fixedFluxPressure;
        gradient        uniform 0;
        value           uniform $pInitial;
    }
}


// ************************************************************************* //
