example/dim/0.atmospheric/alphat
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      alphat;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 2 -1 0 0 0 0 ];

internalField   uniform 0;

boundaryField
{
    outer
    {
        type            fixedValue;
        value           uniform 0;
    }
    inner
    {
        type            fixedValue;
        value           uniform 0;
    }
    Cyl_p1
    {
        type            cyclic;
    }
    Cyl_p2
    {
        type            cyclic;
    }
}


// ************************************************************************* //
