example/dim/constant/turbulenceProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      turbulenceProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

simulationType  laminar;

LES
{
LESModel	dynamicKEqn;//kOmegaSSTDES;

turbulence	on;

printCoeffs	on;

delta		vanDriest;

vanDriestCoeffs
	{
	delta	cubeRootVol;
		cubeRootVolCoeffs
		{
		deltaCoeff 1;
		}
	}


dynamicKEqnCoeffs
	{
	filter	simple;
	}

}

// ************************************************************************* //
